[[query-functions-graph]]
= Graph functions

[abstract]
--
Graph functions provide information about the constituent graphs in <<operations-manual#composite-databases-introduction, composite databases>>.
--

.Graph functions
[options="header", width="100%", cols="2,2a,2a,2"]
|===
| Syntax | Query | Result | Description

| `graph.names()`
| [source, cypher, role=noplay]
----
RETURN graph.names()
----
|
[role="queryresult",options="header,footer",cols="1*<m"]
!===
! +graph.names()+
! +["composite.first", "composite.second", "composite.third"]+
1+d!Rows: 1
!===
| Returns a list containing the names of all graphs on the current composite database.
It is only supported on <<operations-manual#composite-databases-introduction, composite databases>>.
| `USE graph.byName(graphName)`
| [source, cypher, role=noplay]
----
UNWIND graph.names() AS graphName
CALL {
  USE graph.byName(graphName)
  MATCH (n)
  RETURN n
}
RETURN n
----
| Returns all nodes from all graphs on the current composite database.
| Resolves a constituent graph by name.
It is only supported in the <<query-use,`USE` clause>>, on <<operations-manual#composite-databases-introduction, composite databases>>.

|===